; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	infrared0 - mode
	Star3 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star5)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 infrared0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star1)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite2 Planet10)
	(have_image Phenomenon6 image1)
	(have_image Planet7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared0)
	(have_image Star11 image1)
))

)

; plan
1. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite2 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite2 planet7 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet7)
   goals met: 0 of 7
5. (take_image satellite2 planet7 instrument3 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 7
7. (take_image satellite2 phenomenon9 instrument3 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 2 of 7
8. (turn_to satellite2 phenomenon6 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 7
9. (take_image satellite2 phenomenon6 instrument3 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 7
10. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   goals met: 3 of 7
11. (take_image satellite2 planet8 instrument3 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 4 of 7
12. (turn_to satellite2 star11 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star11)
   goals met: 4 of 7
13. (take_image satellite2 star11 instrument3 image1)
   added: (have_image star11 image1)
   goals met: 5 of 7
14. (turn_to satellite2 planet10 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet10)
   goals met: 6 of 7
15. (take_image satellite2 planet10 instrument3 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 7 of 7
